local terriotyCfg={
    
    --领地入口显示条件
    needLv=6,
    
    --领地数量系数-----【实际领地数量= 跨服组区服数量/terriotyNum】--结果向上取整
    terriotyNum=5,
    
    --领地名---【数量，修改消耗元宝，修改cd：秒】
    teName={50,500,86400},
    
    --领地旗帜---【旗帜名数量，旗帜地图数量，修改旗帜消耗元宝，修改旗帜cd：秒】
    teFlag={11,9,500,86400},
    
    --【修改领地公告cd：秒，修改领地宣言cd：秒】
    declaration={86400,86400},
    
    --领地公告字数限制
    maxWord=50,
    
    --领主转让cd：秒
    turnCd=86400,
    
    --官员上任cd---即任命官员后的官员最小任命时间，期间不可修改此官员职位，单位：秒
    officalCd=86400,
    
    --领地特殊道具
    --quality:品质
    --maxNum:最大存储上限
    
    spItem={
        ["1"]={     ----领地贡献--个人
            ["quality"]=3,     ----蓝
        },
        ["2"]={     ----领地经验--领地
            ["quality"]=3,     ----蓝
        },
        ["3"]={     ----领地征伐次数--个人
            ["quality"]=7,     ----金
            ["maxNum"]=100,
        },
        ["4"]={     ----领地宴会次数--个人
            ["quality"]=7,     ----金
            ["maxNum"]=50,
        },
        ["5"]={     ----领地宴会积分--个人
            ["quality"]=4,     ----紫
        },
        ["6"]={     ----领主竞选积分--个人
            ["quality"]=7,     ----金
        },
        ["7"]={     ----疆域贡品--个人
            ["quality"]=7,     ----金
        },
    },
    
    --领主竞选预展示期【天】
    warmupTime=1,
    
    --领主竞选持续时间【天】
    lastTime=4,
    
    --领主竞选结束后的展示期【天】
    extraTime=1,
    
    --每年领主竞选，开始时间（真实开打时间，不算预展示期）
    --openDay:日期2
    --openDay2:测试日期
    
    startTime={
        ["default"]={     ----默认
            ["openDay"]={{2,1,0,0,0},{3,1,0,0,0},{4,1,0,0,0},{5,1,0,0,0},{6,1,0,0,0},{7,1,0,0,0},{8,1,0,0,0},{9,1,0,0,0},{10,1,0,0,0},{11,1,0,0,0},{12,1,0,0,0},{12,28,0,0,0}},
            ["openDay2"]={{2,1,0,0,0},{3,1,0,0,0},{4,1,0,0,0},{5,1,0,0,0},{6,1,0,0,0},{7,1,0,0,0},{8,1,0,0,0},{9,1,0,0,0},{10,1,0,0,0},{11,1,0,0,0},{12,1,0,0,0},{12,27,0,0,0}},
        },
        ["jp"]={     ----日本
            ["openDay"]={{2,1,0,0,0},{3,1,0,0,0},{4,1,0,0,0},{5,1,0,0,0},{6,1,0,0,0},{7,1,0,0,0},{8,1,0,0,0},{9,1,0,0,0},{10,1,0,0,0},{11,1,0,0,0},{12,1,0,0,0},{12,31,0,0,0}},
            ["openDay2"]={{2,1,0,0,0},{3,1,0,0,0},{4,1,0,0,0},{5,1,0,0,0},{6,1,0,0,0},{7,1,0,0,0},{8,1,0,0,0},{9,1,0,0,0},{10,1,0,0,0},{11,1,0,0,0},{12,1,0,0,0},{12,29,0,0,0}},
        },
    },
    
    --领主竞选排名前x名玩家为领地精英
    eliteNum=100,
    
    --人气票目标人数上限
    votekingNum=3,
    
    --人气票目标获得前3名时返还倍率
    votekingwinRate=2,
    
    --x个人气票兑换1元宝
    voteExchangeRate=10,
    
    --人气票兑换
    --voteNum:人气票兑换
    --getReward:奖励
    
    voteExchange={
        ["1"]={
            ["voteNum"]=80,
            ["getReward"]="6_1206_1",
        },
        ["2"]={
            ["voteNum"]=1,
            ["getReward"]="1_1_10",
        },
    },
    
    --门客兑换
    --servantID:门客ID
    --needItem:奖励
    
    servantExchange={
        ["1"]={
            ["servantID"]=2019,
            ["needItem"]="6_1960_10",
        },
    },
    
    --兑换商店（页签数越大的在前面显示）
    --order:排序（倒叙，大的在前面显示）
    --limitExchange:限制兑换条件（玩家如果拥有，则无法再兑换该奖励，不能升级的东西才配置，普通门客皮肤，门客，红颜，宠幸场景，府邸场景）
    --needReward:兑换所需道具
    --getReward:获得道具
    
    exchangeShop={
        ["1"]={
            ["order"]=1,
            ["limitExchange"]="8_2019_1",
            ["needReward"]="6_1960_10",
            ["getReward"]="8_2019_1",
        },
        ["2"]={
            ["order"]=2,
            ["limitExchange"]="19_20191_1",
            ["needReward"]="6_6257_50",
            ["getReward"]="19_20191_1",
        },
        ["3"]={
            ["order"]=3,
            ["limitExchange"]="19_20192_1",
            ["needReward"]="6_17669_50",
            ["getReward"]="19_20192_1",
        },
        ["4"]={
            ["order"]=4,
            ["limitExchange"]="19_20193_1",
            ["needReward"]="6_60290_50",
            ["getReward"]="19_20193_1",
        },
    },
    
    --第一名奖励委任状
    rankNo1reward1="11_3201_1",
    
    --第一名奖励头像框
    rankNo1reward2="11_4006_1",
    
    --人气第一名奖励人气王头像框
    voteReward="11_4017_1",
    
    --领主竞选任务
    --taskType:任务类型
    --value1:参数1【道具id】
    --value2:参数2【每value2单位的消耗，获取一次value3】
    --value3:参数3【获取排名分】    实际获得皇权值=value3*（1+皇权加成）
    
    battlePoint={
        ["1"]={     ----卷轴消耗【不包含卷轴礼包】
            ["taskType"]=204,
            ["value2"]=1,
            ["value3"]=200,
        },
        ["2"]={     ----消耗书籍经验
            ["taskType"]=2501,
            ["value2"]=1,
            ["value3"]=1,
        },
        ["3"]={     ----战马资历
            ["taskType"]=2503,
            ["value2"]=1,
            ["value3"]=1,
        },
        ["4"]={     ----文玩经验
            ["taskType"]=2504,
            ["value2"]=1,
            ["value3"]=1,
        },
        ["5"]={     ----单个促织经验
            ["taskType"]=2505,
            ["value2"]=1,
            ["value3"]=1,
        },
        ["6"]={     ----通用促织经验
            ["taskType"]=2506,
            ["value2"]=1,
            ["value3"]=1,
        },
        ["7"]={     ----奇观经验
            ["taskType"]=2508,
            ["value2"]=1,
            ["value3"]=1,
        },
        ["8"]={     ----奇观宣传卷
            ["taskType"]=2502,
            ["value1"]=2322,
            ["value2"]=1,
            ["value3"]=200,
        },
        ["9"]={     ----一星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1591,
            ["value2"]=1,
            ["value3"]=200,
        },
        ["10"]={     ----二星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1592,
            ["value2"]=1,
            ["value3"]=400,
        },
        ["11"]={     ----三星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1593,
            ["value2"]=1,
            ["value3"]=600,
        },
        ["12"]={     ----四星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1594,
            ["value2"]=1,
            ["value3"]=800,
        },
        ["13"]={     ----五星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1595,
            ["value2"]=1,
            ["value3"]=1000,
        },
        ["14"]={     ----六星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1596,
            ["value2"]=1,
            ["value3"]=1200,
        },
        ["15"]={     ----七星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1597,
            ["value2"]=1,
            ["value3"]=1400,
        },
        ["16"]={     ----八星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1598,
            ["value2"]=1,
            ["value3"]=1600,
        },
        ["17"]={     ----九星书籍宝典
            ["taskType"]=2502,
            ["value1"]=1599,
            ["value2"]=1,
            ["value3"]=1800,
        },
        ["18"]={     ----玛瑙心
            ["taskType"]=2502,
            ["value1"]=1351,
            ["value2"]=1,
            ["value3"]=10,
        },
        ["19"]={     ----翡翠心
            ["taskType"]=2502,
            ["value1"]=1352,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["20"]={     ----木簪
            ["taskType"]=2502,
            ["value1"]=1353,
            ["value2"]=1,
            ["value3"]=10,
        },
        ["21"]={     ----金簪
            ["taskType"]=2502,
            ["value1"]=1354,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["22"]={     ----才艺道具1
            ["taskType"]=2502,
            ["value1"]=1355,
            ["value2"]=1,
            ["value3"]=10,
        },
        ["23"]={     ----才艺道具2
            ["taskType"]=2502,
            ["value1"]=1356,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["24"]={     ----亲密香囊
            ["taskType"]=2502,
            ["value1"]=1361,
            ["value2"]=1,
            ["value3"]=100,
        },
        ["25"]={     ----魅力香囊
            ["taskType"]=2502,
            ["value1"]=1362,
            ["value2"]=1,
            ["value3"]=100,
        },
        ["26"]={     ----才艺香囊
            ["taskType"]=2502,
            ["value1"]=1363,
            ["value2"]=1,
            ["value3"]=100,
        },
        ["27"]={     ----初级亲密香囊
            ["taskType"]=2502,
            ["value1"]=1364,
            ["value2"]=1,
            ["value3"]=10,
        },
        ["28"]={     ----初级魅力香囊
            ["taskType"]=2502,
            ["value1"]=1365,
            ["value2"]=1,
            ["value3"]=10,
        },
        ["29"]={     ----初级才艺香囊
            ["taskType"]=2502,
            ["value1"]=1366,
            ["value2"]=1,
            ["value3"]=10,
        },
        ["30"]={     ----战马速度教鞭
            ["taskType"]=2502,
            ["value1"]=20001,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["31"]={     ----战马耐力教鞭
            ["taskType"]=2502,
            ["value1"]=20002,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["32"]={     ----战马力量教鞭
            ["taskType"]=2502,
            ["value1"]=20003,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["33"]={     ----战马聪慧教鞭
            ["taskType"]=2502,
            ["value1"]=20004,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["34"]={     ----圣兽手册
            ["taskType"]=2502,
            ["value1"]=20008,
            ["value2"]=1,
            ["value3"]=20,
        },
        ["35"]={     ----鉴宝石
            ["taskType"]=2502,
            ["value1"]=1674,
            ["value2"]=1,
            ["value3"]=200,
        },
    },
    
    --加成系数1；皇权加成 = 人望值/（人望值 * 加成系数1 + 加成系数2） + 加成系数3
    prestigeRate1=3,
    
    --加成系数2；皇权加成 = 人望值/（人望值 * 加成系数1 + 加成系数2） + 加成系数3
    prestigeRate2=3000,
    
    --加成系数3；皇权加成 = 人望值/（人望值 * 加成系数1 + 加成系数2） + 加成系数3
    prestigeRate3=0.02,
    
    --领主竞选物资供应---只在竞选期间生效
    --recharge:档位
    --cost:花费元宝
    --limitType:限购类型  1日限购  2活动限购
    --limitNum:限购次数
    --getScore:奖励竞选排名分---人望加成之前
    --getReward:奖励道具
    
    gift={
        ["1"]={     ----免费礼包
            ["limitType"]=1,
            ["limitNum"]=1,
            ["getScore"]=10,
            ["getReward"]="6_5725_1|6_1364_1|6_1365_1|6_1366_1",
        },
        ["2"]={     ----元宝礼包
            ["cost"]=2888,
            ["limitType"]=1,
            ["limitNum"]=10,
            ["getScore"]=1000,
            ["getReward"]="6_1150_1|6_20007_10|6_1674_1|6_1633_1|6_5725_10|6_1351_10|6_1353_10|6_1355_10",
        },
        ["3"]={     ----328礼包
            ["recharge"]="g1071",
            ["limitType"]=1,
            ["limitNum"]=999,
            ["getScore"]=20000,
            ["getReward"]="6_1020_50|6_1020_50|6_1020_50|6_1020_50|6_1150_5|6_20007_50|6_1674_5|6_1633_5",
        },
    },
    
    --战令高级奖励激活（解锁高级奖励）
    --rechargeId:购买所需档位
    --rewardList:对应奖励字段
    --rate:返利倍率
    
    seniorCost={
        [1]={
            ["rechargeId"]="g997",
            ["rewardList"]="senior1",
            ["rate"]=10,
        },
        [2]={
            ["rechargeId"]="g998",
            ["rewardList"]="senior2",
            ["rate"]=5,
        },
    },
    
    --核心展示
    bigReward="19_20193_1",
    
    --政令展示
    passCardShow="19_20191_1|8_2019_1|19_20192_1",
    
    --战令奖励配置
    --scoreCost:通过竞选任务获得的排名分---加成前
    --primary:免费档
    --senior1:中级档
    --senior2:高级档
    
    battlePass={
        [1]={
            ["scoreCost"]=100,
            ["primary"]="6_13181_1",
            ["senior1"]="6_13181_1",
            ["senior2"]="6_34253_3|6_13181_5",
        },
        [2]={
            ["scoreCost"]=200,
            ["primary"]="6_13181_1",
            ["senior1"]="6_13181_1",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [3]={
            ["scoreCost"]=300,
            ["primary"]="6_13181_1",
            ["senior1"]="6_13181_1",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [4]={
            ["scoreCost"]=500,
            ["primary"]="6_13181_1",
            ["senior1"]="6_13181_1",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [5]={
            ["scoreCost"]=700,
            ["primary"]="6_13181_1",
            ["senior1"]="6_13181_1",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [6]={
            ["scoreCost"]=1000,
            ["primary"]="6_1960_1",
            ["senior1"]="6_1960_2",
            ["senior2"]="6_34253_3|6_1960_3",
        },
        [7]={
            ["scoreCost"]=1500,
            ["primary"]="6_13181_2",
            ["senior1"]="6_13181_2",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [8]={
            ["scoreCost"]=2500,
            ["primary"]="6_13181_2",
            ["senior1"]="6_13181_2",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [9]={
            ["scoreCost"]=3500,
            ["primary"]="6_13181_2",
            ["senior1"]="6_13181_2",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [10]={
            ["scoreCost"]=4500,
            ["primary"]="6_13181_2",
            ["senior1"]="6_13181_2",
            ["senior2"]="6_13181_5|6_13181_5",
        },
        [11]={
            ["scoreCost"]=5500,
            ["primary"]="6_13181_4",
            ["senior1"]="6_6257_4",
            ["senior2"]="6_34253_4|6_6257_8",
        },
        [12]={
            ["scoreCost"]=7500,
            ["primary"]="6_13181_4",
            ["senior1"]="6_13181_4",
            ["senior2"]="6_13181_10|6_13181_10",
        },
        [13]={
            ["scoreCost"]=10000,
            ["primary"]="6_13181_6",
            ["senior1"]="6_13181_6",
            ["senior2"]="6_13181_10|6_13181_10",
        },
        [14]={
            ["scoreCost"]=13000,
            ["primary"]="6_13181_6",
            ["senior1"]="6_13181_6",
            ["senior2"]="6_13181_10|6_13181_10",
        },
        [15]={
            ["scoreCost"]=16000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_10|6_13181_10",
        },
        [16]={
            ["scoreCost"]=20000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_15|6_13181_15",
        },
        [17]={
            ["scoreCost"]=24000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_15|6_13181_15",
        },
        [18]={
            ["scoreCost"]=28000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_15|6_13181_15",
        },
        [19]={
            ["scoreCost"]=33000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_15|6_13181_15",
        },
        [20]={
            ["scoreCost"]=38000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_20|6_13181_20",
        },
        [21]={
            ["scoreCost"]=42000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_20|6_13181_20",
        },
        [22]={
            ["scoreCost"]=50000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_20|6_13181_20",
        },
        [23]={
            ["scoreCost"]=60000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_20|6_13181_20",
        },
        [24]={
            ["scoreCost"]=80000,
            ["primary"]="6_13181_10",
            ["senior1"]="6_13181_10",
            ["senior2"]="6_13181_20|6_13181_20",
        },
    },
    
    --领主竞选助威任务
    --pre_task:条件任务标记
    --unlock:解锁任务
    --openType:跳转
    --questType:任务类型  特殊类型：1--登录X天；2--累计消耗 X元宝；10001--充值xx元宝
    --value:进度
    --voteNum:奖励人气票
    --getReward:奖励
    
    task={    ---领主竞选助威任务
        ["1"]={
            ["101"]={   --登录1天
                ["questType"]=1,
                ["value"]=1,
                ["voteNum"]=1,
                ["getReward"]="6_1001_1|6_1002_1|6_1003_1",
            },
            ["102"]={   --登录2天
                ["questType"]=1,
                ["value"]=2,
                ["voteNum"]=1,
                ["getReward"]="6_1001_2|6_1002_1|6_1003_1",
            },
            ["103"]={   --登录3天
                ["questType"]=1,
                ["value"]=3,
                ["voteNum"]=1,
                ["getReward"]="6_1001_2|6_1002_2|6_1003_1",
            },
            ["104"]={   --充值300元宝
                ["pre_task"]=1,
                ["openType"]="recharge",
                ["questType"]=10001,
                ["value"]=300,
                ["voteNum"]=3,
                ["getReward"]="6_1004_1|6_1201_1|6_1411_1",
            },
            ["105"]={   --充值680元宝
                ["openType"]="recharge",
                ["questType"]=10001,
                ["value"]=680,
                ["voteNum"]=5,
                ["getReward"]="6_1004_2|6_1201_2|6_1411_2",
            },
            ["106"]={   --消耗元宝X
                ["questType"]=2,
                ["value"]=1600,
                ["voteNum"]=1,
                ["getReward"]="6_1063_1|6_1082_1|6_1352_1",
            },
            ["107"]={   --消耗元宝X
                ["questType"]=2,
                ["value"]=4000,
                ["voteNum"]=2,
                ["getReward"]="6_1063_1|6_1082_1|6_1352_2",
            },
            ["108"]={   --随机传唤
                ["openType"]="wife",
                ["questType"]=301,
                ["value"]=25,
                ["voteNum"]=1,
                ["getReward"]="6_1211_1|6_1351_1",
            },
            ["109"]={   --随机传唤
                ["openType"]="wife",
                ["questType"]=301,
                ["value"]=50,
                ["voteNum"]=1,
                ["getReward"]="6_1351_1|6_1354_1",
            },
            ["110"]={   --每日寻访
                ["openType"]="search",
                ["questType"]=303,
                ["value"]=25,
                ["voteNum"]=1,
                ["getReward"]="6_1001_1|6_1002_1",
            },
            ["111"]={   --每日寻访
                ["openType"]="search",
                ["questType"]=303,
                ["value"]=50,
                ["voteNum"]=1,
                ["getReward"]="6_1003_1|6_1211_5",
            },
            ["112"]={   --培养子嗣
                ["openType"]="child",
                ["questType"]=402,
                ["value"]=25,
                ["voteNum"]=1,
                ["getReward"]="6_1351_1|6_1211_1",
            },
            ["113"]={
                ["openType"]="child",
                ["questType"]=402,
                ["value"]=50,
                ["voteNum"]=1,
                ["getReward"]="6_1352_1|6_1211_2",
            },
        },
        ["2"]={
            ["201"]={   --充值1980元宝
                ["unlock"]=104,
                ["openType"]="recharge",
                ["questType"]=10001,
                ["value"]=1980,
                ["voteNum"]=20,
                ["getReward"]="6_1004_1|6_1201_1|6_1411_1",
            },
            ["202"]={   --充值6480元宝
                ["unlock"]=104,
                ["openType"]="recharge",
                ["questType"]=10001,
                ["value"]=6480,
                ["voteNum"]=50,
                ["getReward"]="6_1004_2|6_1201_2|6_1411_2",
            },
            ["203"]={   --消耗元宝X
                ["unlock"]=104,
                ["questType"]=2,
                ["value"]=8000,
                ["voteNum"]=2,
                ["getReward"]="6_1063_1|6_1083_1|6_1352_2",
            },
            ["204"]={   --消耗元宝X
                ["unlock"]=104,
                ["questType"]=2,
                ["value"]=12000,
                ["voteNum"]=2,
                ["getReward"]="6_1063_2|6_1083_1|6_1551_1",
            },
            ["205"]={   --随机传唤
                ["unlock"]=104,
                ["openType"]="wife",
                ["questType"]=301,
                ["value"]=100,
                ["voteNum"]=1,
                ["getReward"]="6_1352_1|6_1354_1",
            },
            ["206"]={   --随机传唤
                ["unlock"]=104,
                ["openType"]="wife",
                ["questType"]=301,
                ["value"]=200,
                ["voteNum"]=1,
                ["getReward"]="6_1211_3|6_1352_1",
            },
            ["207"]={   --每日寻访
                ["unlock"]=104,
                ["openType"]="search",
                ["questType"]=303,
                ["value"]=100,
                ["voteNum"]=1,
                ["getReward"]="6_1030_2|6_1083_1|6_1352_1",
            },
            ["208"]={   --每日寻访
                ["unlock"]=104,
                ["openType"]="search",
                ["questType"]=303,
                ["value"]=200,
                ["voteNum"]=1,
                ["getReward"]="6_1021_3|6_1029_2|6_1352_2",
            },
            ["209"]={   --培养子嗣
                ["unlock"]=104,
                ["openType"]="child",
                ["questType"]=402,
                ["value"]=100,
                ["voteNum"]=1,
                ["getReward"]="6_1352_2|6_1211_1",
            },
            ["210"]={   --培养子嗣
                ["unlock"]=104,
                ["openType"]="child",
                ["questType"]=402,
                ["value"]=160,
                ["voteNum"]=1,
                ["getReward"]="6_1206_1|6_1354_2",
            },
        },
    },
    
    
    --领主竞选排行奖励
    --rank:排名
    --reward:奖励
    
    rankReward={
        ["1"]={
            ["rank"]={1,1},
            ["reward"]="451_4_30|451_3_50|8_2019_1|6_34251_15|6_26060_1|6_1751_4|6_1403_3|6_1150_25|6_1151_25|6_1152_25|6_1153_25|6_1154_25|6_1216_25|6_1217_25|6_1218_25|6_1219_25|6_1220_25|6_1004_90|6_1701_252|6_1702_252|6_1703_252|17_1_90",
        },
        ["2"]={
            ["rank"]={2,2},
            ["reward"]="451_4_20|451_3_40|6_34251_10|6_1960_7|6_26060_1|6_1751_3|6_1403_2|6_1150_20|6_1151_20|6_1152_20|6_1153_20|6_1154_20|6_1216_20|6_1217_20|6_1218_20|6_1219_20|6_1220_20|6_1004_80|6_1701_216|6_1702_216|6_1703_216|17_1_80",
        },
        ["3"]={
            ["rank"]={3,3},
            ["reward"]="451_4_10|451_3_30|6_34251_7|6_1960_5|6_26060_1|6_1751_2|6_1403_1|6_1150_15|6_1151_15|6_1152_15|6_1153_15|6_1154_15|6_1216_15|6_1217_15|6_1218_15|6_1219_15|6_1220_15|6_1004_60|6_1701_180|6_1702_180|6_1703_180|17_1_70",
        },
        ["4"]={
            ["rank"]={4,5},
            ["reward"]="451_3_20|6_34251_4|6_1960_4|6_1751_1|6_1150_12|6_1151_12|6_1152_12|6_1153_12|6_1154_12|6_1216_12|6_1217_12|6_1218_12|6_1219_12|6_1220_12|6_1004_50|6_1701_135|6_1702_135|6_1703_135|17_1_50",
        },
        ["5"]={
            ["rank"]={6,10},
            ["reward"]="451_3_10|6_34251_3|6_1960_3|6_1150_6|6_1151_9|6_1152_9|6_1153_9|6_1154_9|6_1216_9|6_1217_9|6_1218_9|6_1219_9|6_1220_9|6_1004_40|6_1701_99|6_1702_99|6_1703_99|17_1_30",
        },
        ["6"]={
            ["rank"]={11,20},
            ["reward"]="6_34251_2|6_1960_2|6_1150_5|6_1151_7|6_1152_7|6_1153_7|6_1154_7|6_1216_7|6_1217_7|6_1218_7|6_1219_7|6_1220_7|6_1004_30|6_1701_72|6_1702_72|6_1703_72",
        },
        ["7"]={
            ["rank"]={21,50},
            ["reward"]="6_34251_1|6_1960_1|6_1150_4|6_1151_5|6_1152_5|6_1153_5|6_1154_5|6_1216_5|6_1217_5|6_1218_5|6_1219_5|6_1220_5|6_1004_20|6_1701_54|6_1702_54|6_1703_54",
        },
        ["8"]={
            ["rank"]={51,100},
            ["reward"]="6_1960_1|6_1150_3|6_1151_3|6_1152_3|6_1153_3|6_1154_3|6_1216_3|6_1217_3|6_1218_3|6_1219_3|6_1220_3|6_1004_10|6_1701_36|6_1702_36|6_1703_36",
        },
        ["9"]={
            ["rank"]={101,9999},
            ["reward"]="6_1150_2|6_1151_2|6_1152_2|6_1153_2|6_1154_2|6_1216_2|6_1217_2|6_1218_2|6_1219_2|6_1220_2|6_1004_5|6_1701_27|6_1702_27|6_1703_27",
        },
    },
    
    --领地官员
    --type:官员类型 1领主 2御前大臣 3大学士 4总督 5将军 6巡抚
    --order:展示排序
    --needLv:解锁需要领地等级
    --spGet:每天获取征伐次数--【数组第一位代表周一，0表示不送，1表示送】
    --buildBuff:帮会建设加成---实际获取奖励=配置奖励*（1+buff）
    --dinnerBuff:宴会积分buff---实际获取积分=配置积分*（1+buff）
    --getScoreBuff:领主竞选buff--领主竞选时，上任领主获取分数 = 配置分数*（1+buff）----任何来源，包含礼包
    
    official={
        ["1"]={     ----领主
            ["type"]=1,
            ["order"]=1,
            ["needLv"]=1,
            ["spGet"]={10,10,10,10,10,10,10},
            ["buildBuff"]=0.3,
            ["dinnerBuff"]=0.3,
        },
        ["2"]={     ----御前大臣
            ["type"]=2,
            ["order"]=2,
            ["needLv"]=3,
            ["spGet"]={10,0,10,0,10,0,10},
            ["buildBuff"]=0.2,
            ["dinnerBuff"]=0.2,
        },
        ["3"]={     ----御前大臣
            ["type"]=2,
            ["order"]=4,
            ["needLv"]=3,
            ["spGet"]={10,0,10,0,10,0,10},
            ["buildBuff"]=0.2,
            ["dinnerBuff"]=0.2,
        },
        ["4"]={     ----御前大臣
            ["type"]=2,
            ["order"]=3,
            ["needLv"]=3,
            ["spGet"]={0,10,0,10,0,10,10},
            ["buildBuff"]=0.2,
            ["dinnerBuff"]=0.2,
        },
        ["5"]={     ----御前大臣
            ["type"]=2,
            ["order"]=5,
            ["needLv"]=3,
            ["spGet"]={0,10,0,10,0,10,10},
            ["buildBuff"]=0.2,
            ["dinnerBuff"]=0.2,
        },
        ["6"]={     ----大学士
            ["type"]=3,
            ["order"]=6,
            ["needLv"]=2,
            ["buildBuff"]=0.1,
            ["dinnerBuff"]=0.1,
        },
        ["7"]={     ----大学士
            ["type"]=3,
            ["order"]=7,
            ["needLv"]=2,
            ["buildBuff"]=0.1,
            ["dinnerBuff"]=0.1,
        },
        ["8"]={     ----大学士
            ["type"]=3,
            ["order"]=8,
            ["needLv"]=2,
            ["buildBuff"]=0.1,
            ["dinnerBuff"]=0.1,
        },
        ["9"]={     ----大学士
            ["type"]=3,
            ["order"]=9,
            ["needLv"]=2,
            ["buildBuff"]=0.1,
            ["dinnerBuff"]=0.1,
        },
        ["10"]={     ----大学士
            ["type"]=3,
            ["order"]=10,
            ["needLv"]=2,
            ["buildBuff"]=0.1,
            ["dinnerBuff"]=0.1,
        },
        ["11"]={     ----大学士
            ["type"]=3,
            ["order"]=11,
            ["needLv"]=2,
            ["buildBuff"]=0.1,
            ["dinnerBuff"]=0.1,
        },
        ["12"]={     ----总督
            ["type"]=4,
            ["order"]=18,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["13"]={     ----总督
            ["type"]=4,
            ["order"]=19,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["14"]={     ----总督
            ["type"]=4,
            ["order"]=20,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["15"]={     ----总督
            ["type"]=4,
            ["order"]=21,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["16"]={     ----总督
            ["type"]=4,
            ["order"]=22,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["17"]={     ----总督
            ["type"]=4,
            ["order"]=23,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["18"]={     ----总督
            ["type"]=4,
            ["order"]=24,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["19"]={     ----总督
            ["type"]=4,
            ["order"]=25,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["20"]={     ----将军
            ["type"]=5,
            ["order"]=26,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["21"]={     ----将军
            ["type"]=5,
            ["order"]=27,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["22"]={     ----将军
            ["type"]=5,
            ["order"]=28,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["23"]={     ----将军
            ["type"]=5,
            ["order"]=29,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["24"]={     ----将军
            ["type"]=5,
            ["order"]=30,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["25"]={     ----将军
            ["type"]=5,
            ["order"]=31,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["26"]={     ----将军
            ["type"]=5,
            ["order"]=32,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["27"]={     ----将军
            ["type"]=5,
            ["order"]=33,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["28"]={     ----将军
            ["type"]=5,
            ["order"]=34,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["29"]={     ----将军
            ["type"]=5,
            ["order"]=35,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["30"]={     ----将军
            ["type"]=5,
            ["order"]=36,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["31"]={     ----将军
            ["type"]=5,
            ["order"]=37,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["32"]={     ----巡抚
            ["type"]=6,
            ["order"]=38,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["33"]={     ----巡抚
            ["type"]=6,
            ["order"]=39,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["34"]={     ----巡抚
            ["type"]=6,
            ["order"]=40,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["35"]={     ----巡抚
            ["type"]=6,
            ["order"]=41,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["36"]={     ----巡抚
            ["type"]=6,
            ["order"]=38,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["37"]={     ----巡抚
            ["type"]=6,
            ["order"]=39,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["38"]={     ----巡抚
            ["type"]=6,
            ["order"]=40,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["39"]={     ----巡抚
            ["type"]=6,
            ["order"]=41,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["40"]={     ----巡抚
            ["type"]=6,
            ["order"]=38,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["41"]={     ----巡抚
            ["type"]=6,
            ["order"]=39,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["42"]={     ----巡抚
            ["type"]=6,
            ["order"]=40,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["43"]={     ----巡抚
            ["type"]=6,
            ["order"]=41,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["44"]={     ----巡抚
            ["type"]=6,
            ["order"]=38,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["45"]={     ----巡抚
            ["type"]=6,
            ["order"]=39,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["46"]={     ----巡抚
            ["type"]=6,
            ["order"]=40,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["47"]={     ----巡抚
            ["type"]=6,
            ["order"]=41,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["48"]={     ----巡抚
            ["type"]=6,
            ["order"]=38,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["49"]={     ----巡抚
            ["type"]=6,
            ["order"]=39,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["50"]={     ----巡抚
            ["type"]=6,
            ["order"]=40,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
        ["51"]={     ----巡抚
            ["type"]=6,
            ["order"]=41,
            ["needLv"]=1,
            ["dinnerBuff"]=0.05,
        },
    },
    
    --每日膜拜次数
    dayMobaiTime=1,
    
    --膜拜奖励
    mobaiReward="1_1_50",
    
    --玩家每日可建设消耗元宝---0为免费，数组长度为每日最大建设次数
    constructionTime={0,50,200},
    
    --玩家每次建设奖励1---领地贡献
    constructionGet1="451_1_100",
    
    --玩家每次建设奖励2---领地经验
    constructionGet2=100,
    
    --昨日领地建设人数奖励---只统计建设人数，不统计建设次数
    --needNum:需要人数
    --getReward:奖励
    
    schedule={
        ["1"]={
            ["needNum"]=15,
            ["getReward"]="451_3_1|6_1233_1",
        },
        ["2"]={
            ["needNum"]=30,
            ["getReward"]="451_3_1|6_1150_1",
        },
        ["3"]={
            ["needNum"]=50,
            ["getReward"]="451_3_1|6_1233_1",
        },
        ["4"]={
            ["needNum"]=100,
            ["getReward"]="451_3_1|6_1150_1",
        },
        ["5"]={
            ["needNum"]=200,
            ["getReward"]="451_3_1|6_5726_1",
        },
    },
    
    --领地等级
    --maxPlayer:最大人数
    --needExp:达到指定等级需要领地经验--领地达到x---领地默认1级
    
    terriotyLv={
        ["1"]={
        },
        ["2"]={
            ["needExp"]=600000,
        },
        ["3"]={
            ["needExp"]=1500000,
        },
        ["4"]={
            ["needExp"]=3000000,
        },
        ["5"]={
            ["needExp"]=5250000,
        },
        ["6"]={
            ["needExp"]=8250000,
        },
        ["7"]={
            ["needExp"]=12750000,
        },
        ["8"]={
            ["needExp"]=20250000,
        },
        ["9"]={
            ["needExp"]=30750000,
        },
        ["10"]={
            ["needExp"]=45750000,
        },
    },
    
    --领地贡献商店
    --needLv:需要领地等级
    --getReward:内容
    --limitType:限购类型  1日限购  2周限购（自然周） 3月限购（自然月）
    --limitNum:限购次数
    --switch:开关判断
    --cost:购买消耗:领地贡献--个人     超过最大值取最大值
    
    shop1={
        ["1"]={
            ["needLv"]=1,
            ["getReward"]="6_1752_1",
            ["limitType"]=2,
            ["limitNum"]=1,
            ["cost"]={500},
        },
        ["2"]={
            ["needLv"]=1,
            ["getReward"]="6_1150_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={200,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2400,2800,3200,3600,4000,4400},
        },
        ["3"]={
            ["needLv"]=1,
            ["getReward"]="6_20007_10",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={200,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2400,2800,3200,3600,4000,4400},
        },
        ["4"]={
            ["needLv"]=1,
            ["getReward"]="6_1674_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["switch"]="openCurios",
            ["cost"]={200,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2400,2800,3200,3600,4000,4400},
        },
        ["5"]={
            ["needLv"]=1,
            ["getReward"]="6_1633_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["switch"]="openCrickets",
            ["cost"]={200,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2400,2800,3200,3600,4000,4400},
        },
        ["6"]={
            ["needLv"]=2,
            ["getReward"]="6_1701_1",
            ["limitType"]=2,
            ["limitNum"]=15,
            ["cost"]={50,75,100,125,150,175,200,225,250,300,350,400,450,500,600,700,800,900,1000,1100},
        },
        ["7"]={
            ["needLv"]=2,
            ["getReward"]="6_1702_1",
            ["limitType"]=2,
            ["limitNum"]=15,
            ["cost"]={50,75,100,125,150,175,200,225,250,300,350,400,450,500,600,700,800,900,1000,1100},
        },
        ["8"]={
            ["needLv"]=2,
            ["getReward"]="6_1703_1",
            ["limitType"]=2,
            ["limitNum"]=15,
            ["cost"]={50,75,100,125,150,175,200,225,250,300,350,400,450,500,600,700,800,900,1000,1100},
        },
        ["9"]={
            ["needLv"]=3,
            ["getReward"]="6_1361_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={100,150,200,250,300,350,400,450,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2200},
        },
        ["10"]={
            ["needLv"]=3,
            ["getReward"]="6_1362_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={100,150,200,250,300,350,400,450,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2200},
        },
        ["11"]={
            ["needLv"]=3,
            ["getReward"]="6_1363_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={100,150,200,250,300,350,400,450,500,600,700,800,900,1000,1200,1400,1600,1800,2000,2200},
        },
        ["12"]={
            ["needLv"]=4,
            ["getReward"]="6_1684_1",
            ["limitType"]=2,
            ["limitNum"]=15,
            ["switch"]="openCurios",
            ["cost"]={50,75,100,125,150,175,200,225,250,300,350,400,450,500,600,700,800,900,1000,1100},
        },
        ["13"]={
            ["needLv"]=4,
            ["getReward"]="6_1636_1",
            ["limitType"]=2,
            ["limitNum"]=15,
            ["switch"]="openCrickets",
            ["cost"]={50,75,100,125,150,175,200,225,250,300,350,400,450,500,600,700,800,900,1000,1100},
        },
    },
    
    --领地征伐发起消耗---参与集结不消耗任何东西---不再每日情况，可以储存
    fightCost="451_3_10",
    
    --领地征伐发起后的持续时间【时】
    fightLastTime=6,
    
    --集结出发的最低人数要求，不满足条件时，不出发，直接失败---包含发起者自己
    fightNum1=2,
    
    --集结怪物最多参与人数---包括发起者自己---达到此人数时立刻出发攻打怪物，无需等待集结时间
    fightNum2=20,
    
    --集结怪物的每个参与者除了自己的战力，还会额外增加队伍的战力，增加值为【发起者战力*fightParameter2】
    fightParameter2=0.05,
    
    --征伐参与者每日最大获取奖励次数
    maxKillRewardTime=1,
    
    --征伐怪物的额外掉落---怪物被击杀后，除配置之外的额外奖励，不是必出---只有发起者会有
    extraReward="451_4_1",
    
    --征伐怪物额外掉落概率和保底次数
    extraWeight={1,1},
    
    --玩家怪物匹配列表
    --power:玩家权势范围
    --monsterLv:怪物等级范围
    --monsterWeight:怪物等级随机权重
    
    monsterMatch={
        ["1"]={
            ["power"]={1 ,10000000 },
            ["monsterLv"]={1,1},
            ["monsterWeight"]={100,100},
        },
        ["2"]={
            ["power"]={10000001 ,20000000 },
            ["monsterLv"]={2,2},
            ["monsterWeight"]={100,100},
        },
        ["3"]={
            ["power"]={20000001 ,30000000 },
            ["monsterLv"]={3,3},
            ["monsterWeight"]={100,100},
        },
        ["4"]={
            ["power"]={30000001 ,40000000 },
            ["monsterLv"]={4,4},
            ["monsterWeight"]={100,100},
        },
        ["5"]={
            ["power"]={40000001 ,50000000 },
            ["monsterLv"]={5,5},
            ["monsterWeight"]={100,100},
        },
        ["6"]={
            ["power"]={50000001 ,60000000 },
            ["monsterLv"]={6,6},
            ["monsterWeight"]={100,100},
        },
        ["7"]={
            ["power"]={60000001 ,70000000 },
            ["monsterLv"]={7,7},
            ["monsterWeight"]={100,100},
        },
        ["8"]={
            ["power"]={70000001 ,80000000 },
            ["monsterLv"]={8,8},
            ["monsterWeight"]={100,100},
        },
        ["9"]={
            ["power"]={80000001 ,90000000 },
            ["monsterLv"]={9,9},
            ["monsterWeight"]={100,100},
        },
        ["10"]={
            ["power"]={90000001 ,100000000 },
            ["monsterLv"]={10,10},
            ["monsterWeight"]={100,100},
        },
        ["11"]={
            ["power"]={100000001 ,200000000 },
            ["monsterLv"]={11,11},
            ["monsterWeight"]={100,100},
        },
        ["12"]={
            ["power"]={200000001 ,300000000 },
            ["monsterLv"]={12,12},
            ["monsterWeight"]={100,100},
        },
        ["13"]={
            ["power"]={300000001 ,400000000 },
            ["monsterLv"]={13,13},
            ["monsterWeight"]={100,100},
        },
        ["14"]={
            ["power"]={400000001 ,500000000 },
            ["monsterLv"]={14,14},
            ["monsterWeight"]={100,100},
        },
        ["15"]={
            ["power"]={500000001 ,600000000 },
            ["monsterLv"]={15,15},
            ["monsterWeight"]={100,100},
        },
        ["16"]={
            ["power"]={600000001 ,700000000 },
            ["monsterLv"]={16,16},
            ["monsterWeight"]={100,100},
        },
        ["17"]={
            ["power"]={700000001 ,800000000 },
            ["monsterLv"]={17,17},
            ["monsterWeight"]={100,100},
        },
        ["18"]={
            ["power"]={800000001 ,900000000 },
            ["monsterLv"]={18,18},
            ["monsterWeight"]={100,100},
        },
        ["19"]={
            ["power"]={900000001 ,1000000000 },
            ["monsterLv"]={19,19},
            ["monsterWeight"]={100,100},
        },
        ["20"]={
            ["power"]={1000000001 ,2000000000 },
            ["monsterLv"]={20,20},
            ["monsterWeight"]={100,100},
        },
        ["21"]={
            ["power"]={2000000001 ,3000000000 },
            ["monsterLv"]={21,21},
            ["monsterWeight"]={100,100},
        },
        ["22"]={
            ["power"]={3000000001 ,4000000000 },
            ["monsterLv"]={22,22},
            ["monsterWeight"]={100,100},
        },
        ["23"]={
            ["power"]={4000000001 ,5000000000 },
            ["monsterLv"]={23,23},
            ["monsterWeight"]={100,100},
        },
        ["24"]={
            ["power"]={5000000001 ,6000000000 },
            ["monsterLv"]={24,24},
            ["monsterWeight"]={100,100},
        },
        ["25"]={
            ["power"]={6000000001 ,7000000000 },
            ["monsterLv"]={25,25},
            ["monsterWeight"]={100,100},
        },
        ["26"]={
            ["power"]={7000000001 ,8000000000 },
            ["monsterLv"]={26,26},
            ["monsterWeight"]={100,100},
        },
        ["27"]={
            ["power"]={8000000001 ,9000000000 },
            ["monsterLv"]={27,27},
            ["monsterWeight"]={100,100},
        },
        ["28"]={
            ["power"]={9000000001 ,10000000000 },
            ["monsterLv"]={28,28},
            ["monsterWeight"]={100,100},
        },
        ["29"]={
            ["power"]={10000000001 ,20000000000 },
            ["monsterLv"]={29,29},
            ["monsterWeight"]={100,100},
        },
        ["30"]={
            ["power"]={20000000001 ,30000000000 },
            ["monsterLv"]={30,30},
            ["monsterWeight"]={100,100},
        },
        ["31"]={
            ["power"]={30000000001 ,40000000000 },
            ["monsterLv"]={31,31},
            ["monsterWeight"]={100,100},
        },
        ["32"]={
            ["power"]={40000000001 ,50000000000 },
            ["monsterLv"]={32,32},
            ["monsterWeight"]={100,100},
        },
        ["33"]={
            ["power"]={50000000001 ,60000000000 },
            ["monsterLv"]={33,33},
            ["monsterWeight"]={100,100},
        },
        ["34"]={
            ["power"]={60000000001 ,70000000000 },
            ["monsterLv"]={34,34},
            ["monsterWeight"]={100,100},
        },
        ["35"]={
            ["power"]={70000000001 ,80000000000 },
            ["monsterLv"]={35,35},
            ["monsterWeight"]={100,100},
        },
        ["36"]={
            ["power"]={80000000001 ,90000000000 },
            ["monsterLv"]={36,36},
            ["monsterWeight"]={100,100},
        },
        ["37"]={
            ["power"]={90000000001 ,100000000000 },
            ["monsterLv"]={37,37},
            ["monsterWeight"]={100,100},
        },
        ["38"]={
            ["power"]={100000000001 ,200000000000 },
            ["monsterLv"]={38,38},
            ["monsterWeight"]={100,100},
        },
        ["39"]={
            ["power"]={200000000001 ,300000000000 },
            ["monsterLv"]={39,39},
            ["monsterWeight"]={100,100},
        },
        ["40"]={
            ["power"]={300000000001 ,400000000000 },
            ["monsterLv"]={40,40},
            ["monsterWeight"]={100,100},
        },
        ["41"]={
            ["power"]={400000000001 ,500000000000 },
            ["monsterLv"]={41,41},
            ["monsterWeight"]={100,100},
        },
        ["42"]={
            ["power"]={500000000001 ,600000000000 },
            ["monsterLv"]={42,42},
            ["monsterWeight"]={100,100},
        },
        ["43"]={
            ["power"]={600000000001 ,700000000000 },
            ["monsterLv"]={43,43},
            ["monsterWeight"]={100,100},
        },
        ["44"]={
            ["power"]={700000000001 ,800000000000 },
            ["monsterLv"]={44,44},
            ["monsterWeight"]={100,100},
        },
        ["45"]={
            ["power"]={800000000001 ,900000000000 },
            ["monsterLv"]={45,45},
            ["monsterWeight"]={100,100},
        },
        ["46"]={
            ["power"]={900000000001 ,1000000000000 },
            ["monsterLv"]={46,46},
            ["monsterWeight"]={100,100},
        },
        ["47"]={
            ["power"]={1000000000001 ,2000000000000 },
            ["monsterLv"]={47,47},
            ["monsterWeight"]={100,100},
        },
        ["48"]={
            ["power"]={2000000000001 ,3000000000000 },
            ["monsterLv"]={48,48},
            ["monsterWeight"]={100,100},
        },
        ["49"]={
            ["power"]={3000000000001 ,4000000000000 },
            ["monsterLv"]={49,49},
            ["monsterWeight"]={100,100},
        },
        ["50"]={
            ["power"]={4000000000001 ,5000000000000 },
            ["monsterLv"]={50,50},
            ["monsterWeight"]={100,100},
        },
    },
    
    --征伐怪物列表
    --power:怪物权势
    --getExp:征伐集结者奖励领地经验--领地
    --getReward1:征伐集结者奖励
    --getReward2:征伐参与者奖励
    
    monster={
        ["1"]={     ----1亿
            ["power"]=10000000,
            ["getExp"]=100,
            ["getReward1"]="451_1_100|1_1_100|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["2"]={     ----2亿
            ["power"]=20000000,
            ["getExp"]=110,
            ["getReward1"]="451_1_105|1_1_102|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["3"]={     ----3亿
            ["power"]=30000000,
            ["getExp"]=120,
            ["getReward1"]="451_1_110|1_1_104|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["4"]={     ----4亿
            ["power"]=40000000,
            ["getExp"]=130,
            ["getReward1"]="451_1_115|1_1_106|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["5"]={     ----5亿
            ["power"]=50000000,
            ["getExp"]=140,
            ["getReward1"]="451_1_120|1_1_108|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["6"]={     ----6亿
            ["power"]=60000000,
            ["getExp"]=150,
            ["getReward1"]="451_1_125|1_1_110|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["7"]={     ----7亿
            ["power"]=70000000,
            ["getExp"]=160,
            ["getReward1"]="451_1_130|1_1_112|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["8"]={     ----8亿
            ["power"]=80000000,
            ["getExp"]=170,
            ["getReward1"]="451_1_135|1_1_114|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["9"]={     ----9亿
            ["power"]=90000000,
            ["getExp"]=180,
            ["getReward1"]="451_1_140|1_1_116|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["10"]={     ----10亿
            ["power"]=100000000,
            ["getExp"]=190,
            ["getReward1"]="451_1_145|1_1_118|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["11"]={     ----20亿
            ["power"]=200000000,
            ["getExp"]=200,
            ["getReward1"]="451_1_150|1_1_120|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["12"]={     ----30亿
            ["power"]=300000000,
            ["getExp"]=210,
            ["getReward1"]="451_1_155|1_1_122|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["13"]={     ----40亿
            ["power"]=400000000,
            ["getExp"]=220,
            ["getReward1"]="451_1_160|1_1_124|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["14"]={     ----50亿
            ["power"]=500000000,
            ["getExp"]=230,
            ["getReward1"]="451_1_165|1_1_126|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["15"]={     ----60亿
            ["power"]=600000000,
            ["getExp"]=240,
            ["getReward1"]="451_1_170|1_1_128|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["16"]={     ----70亿
            ["power"]=700000000,
            ["getExp"]=250,
            ["getReward1"]="451_1_175|1_1_130|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["17"]={     ----80亿
            ["power"]=800000000,
            ["getExp"]=260,
            ["getReward1"]="451_1_180|1_1_132|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["18"]={     ----90亿
            ["power"]=900000000,
            ["getExp"]=270,
            ["getReward1"]="451_1_185|1_1_134|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["19"]={     ----100亿
            ["power"]=1000000000,
            ["getExp"]=280,
            ["getReward1"]="451_1_190|1_1_136|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["20"]={     ----200亿
            ["power"]=2000000000,
            ["getExp"]=290,
            ["getReward1"]="451_1_195|1_1_138|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["21"]={     ----300亿
            ["power"]=3000000000,
            ["getExp"]=300,
            ["getReward1"]="451_1_200|1_1_140|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["22"]={     ----400亿
            ["power"]=4000000000,
            ["getExp"]=310,
            ["getReward1"]="451_1_205|1_1_142|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["23"]={     ----500亿
            ["power"]=5000000000,
            ["getExp"]=320,
            ["getReward1"]="451_1_210|1_1_144|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["24"]={     ----600亿
            ["power"]=6000000000,
            ["getExp"]=330,
            ["getReward1"]="451_1_215|1_1_146|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["25"]={     ----700亿
            ["power"]=7000000000,
            ["getExp"]=340,
            ["getReward1"]="451_1_220|1_1_148|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["26"]={     ----800亿
            ["power"]=8000000000,
            ["getExp"]=350,
            ["getReward1"]="451_1_225|1_1_150|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["27"]={     ----900亿
            ["power"]=9000000000,
            ["getExp"]=360,
            ["getReward1"]="451_1_230|1_1_152|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["28"]={     ----1000亿
            ["power"]=10000000000,
            ["getExp"]=370,
            ["getReward1"]="451_1_235|1_1_154|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["29"]={     ----1500亿
            ["power"]=20000000000,
            ["getExp"]=380,
            ["getReward1"]="451_1_240|1_1_156|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["30"]={     ----2000亿
            ["power"]=30000000000,
            ["getExp"]=390,
            ["getReward1"]="451_1_245|1_1_158|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["31"]={     ----2500亿
            ["power"]=40000000000,
            ["getExp"]=400,
            ["getReward1"]="451_1_250|1_1_160|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["32"]={     ----3000亿
            ["power"]=50000000000,
            ["getExp"]=410,
            ["getReward1"]="451_1_255|1_1_162|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["33"]={     ----3500亿
            ["power"]=60000000000,
            ["getExp"]=420,
            ["getReward1"]="451_1_260|1_1_164|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["34"]={     ----4000亿
            ["power"]=70000000000,
            ["getExp"]=430,
            ["getReward1"]="451_1_265|1_1_166|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["35"]={     ----4500亿
            ["power"]=80000000000,
            ["getExp"]=440,
            ["getReward1"]="451_1_270|1_1_168|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["36"]={     ----5000亿
            ["power"]=90000000000,
            ["getExp"]=450,
            ["getReward1"]="451_1_275|1_1_170|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["37"]={     ----5500亿
            ["power"]=100000000000,
            ["getExp"]=460,
            ["getReward1"]="451_1_280|1_1_172|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["38"]={     ----6000亿
            ["power"]=200000000000,
            ["getExp"]=470,
            ["getReward1"]="451_1_285|1_1_174|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["39"]={     ----6500亿
            ["power"]=300000000000,
            ["getExp"]=480,
            ["getReward1"]="451_1_290|1_1_176|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["40"]={     ----7000亿
            ["power"]=400000000000,
            ["getExp"]=490,
            ["getReward1"]="451_1_295|1_1_178|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["41"]={     ----7500亿
            ["power"]=500000000000,
            ["getExp"]=500,
            ["getReward1"]="451_1_300|1_1_180|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["42"]={     ----8000亿
            ["power"]=600000000000,
            ["getExp"]=510,
            ["getReward1"]="451_1_305|1_1_182|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["43"]={     ----8500亿
            ["power"]=700000000000,
            ["getExp"]=520,
            ["getReward1"]="451_1_310|1_1_184|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["44"]={     ----9000亿
            ["power"]=800000000000,
            ["getExp"]=530,
            ["getReward1"]="451_1_315|1_1_186|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["45"]={     ----9500亿
            ["power"]=900000000000,
            ["getExp"]=540,
            ["getReward1"]="451_1_320|1_1_188|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["46"]={     ----1兆
            ["power"]=1000000000000,
            ["getExp"]=550,
            ["getReward1"]="451_1_325|1_1_190|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["47"]={     ----1.1兆
            ["power"]=2000000000000,
            ["getExp"]=560,
            ["getReward1"]="451_1_330|1_1_192|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["48"]={     ----1.2兆
            ["power"]=3000000000000,
            ["getExp"]=570,
            ["getReward1"]="451_1_335|1_1_194|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["49"]={     ----1.3兆
            ["power"]=4000000000000,
            ["getExp"]=580,
            ["getReward1"]="451_1_340|1_1_196|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
        ["50"]={     ----1.4兆
            ["power"]=5000000000000,
            ["getExp"]=590,
            ["getReward1"]="451_1_345|1_1_198|6_5726_1|6_1233_1|6_14008_9",
            ["getReward2"]="451_1_100|1_1_25|6_1150_1|6_1233_1",
        },
    },
    
    --开宴消耗
    dinnerCost="451_4_10",
    
    --宴会持续时间【时】
    dinnerLastTime=12,
    
    --宴会席位数---不算发起者自己
    dinnerPlayerNum=20,
    
    --宴会空位补偿分---每个空位奖励宴会积分
    addScore=80,
    
    --赴宴消耗
    --cost:消耗
    --getReward:奖励宴会积分
    
    getDinnerCost={
        ["1"]={
            ["cost"]="1_1_100",
            ["getReward"]=100,
        },
        ["2"]={
            ["cost"]="6_1513_1",
            ["getReward"]=1000,
        },
    },
    
    --亲密关系的判定次数---互宴次数大于等于x次---双向
    dinnerQinMi=2,
    
    --宴会商店
    --getReward:内容
    --limitType:限购类型  1日限购  2周限购  3月限购  4永久限购/活动限购
    --limitNum:限购次数
    --switch:开关判断
    --cost:购买消耗：宴会积分    超过最大值取最大值
    
    dinnerShop={
        ["1"]={     ----每10天举办1次宴会
            ["getReward"]="6_34059_1",
            ["limitType"]=2,
            ["limitNum"]=25,
            ["switch"]="openLegion",
            ["cost"]={500,500},
        },
        ["2"]={
            ["getReward"]="6_1752_1",
            ["limitType"]=2,
            ["limitNum"]=1,
            ["cost"]={1000,1000},
        },
        ["3"]={
            ["getReward"]="6_1595_1",
            ["limitType"]=2,
            ["limitNum"]=1,
            ["cost"]={500,500},
        },
        ["4"]={
            ["getReward"]="6_1150_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={500,500},
        },
        ["5"]={
            ["getReward"]="6_1216_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={500,500},
        },
        ["6"]={
            ["getReward"]="6_20007_10",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={200,200},
        },
        ["7"]={
            ["getReward"]="6_1030_10",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["cost"]={200,200},
        },
        ["8"]={
            ["getReward"]="6_1674_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["switch"]="openCurios",
            ["cost"]={200,200},
        },
        ["9"]={
            ["getReward"]="6_1684_1",
            ["limitType"]=2,
            ["limitNum"]=20,
            ["switch"]="openCurios",
            ["cost"]={100,100},
        },
        ["10"]={
            ["getReward"]="6_1633_1",
            ["limitType"]=2,
            ["limitNum"]=10,
            ["switch"]="openCrickets",
            ["cost"]={200,200},
        },
        ["11"]={
            ["getReward"]="6_1636_1",
            ["limitType"]=2,
            ["limitNum"]=20,
            ["switch"]="openCrickets",
            ["cost"]={100,100},
        },
    },
    
    --霸主之路
    --order:顺序
    --land:所属大陆   0为全球霸主，所有大陆都显示同一个
    --shangxianReward:疆域称号上线奖励（每个称号，只生效3天）
    --newKingReward:新任称号奖励
    --zhuheReward:祝贺奖励
    --needType:解锁条件  1占领指定（判断当前状态）单个多个    2占领指定（判断当前状态）多个国家     3占领指定单个大陆   4待定
    --needValue1:解锁具体需求
    
    build={
        ["10101"]={     ----疆域蜀王委任状
            ["order"]=1,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={1},
        },
        ["10102"]={     ----疆域楚王委任状
            ["order"]=2,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={2},
        },
        ["10103"]={     ----疆域燕王委任状
            ["order"]=3,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={3},
        },
        ["10104"]={     ----疆域凉王委任状
            ["order"]=4,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={4},
        },
        ["10105"]={     ----疆域南诏王委任状
            ["order"]=5,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={5},
        },
        ["10106"]={     ----疆域南越王委任状
            ["order"]=6,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={6},
        },
        ["10107"]={     ----疆域暹罗王委任状
            ["order"]=7,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={7},
        },
        ["10108"]={     ----疆域蒲甘王委任状
            ["order"]=8,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={8},
        },
        ["10109"]={     ----疆域转轮圣王委任状
            ["order"]=9,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={9},
        },
        ["10110"]={     ----疆域率众王委任状
            ["order"]=10,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={10},
        },
        ["10111"]={     ----疆域柔然可汗委任状
            ["order"]=11,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={11},
        },
        ["10112"]={     ----疆域伊利可汗委任状
            ["order"]=12,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={12},
        },
        ["10113"]={     ----疆域辽王委任状
            ["order"]=13,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={13},
        },
        ["10114"]={     ----疆域阿萨兰汗委任状
            ["order"]=14,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={14},
        },
        ["10115"]={     ----疆域大单于委任状
            ["order"]=15,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={15},
        },
        ["10116"]={     ----疆域吐蕃赞普委任状
            ["order"]=16,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={16},
        },
        ["10117"]={     ----疆域楼兰王委任状
            ["order"]=17,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={17},
        },
        ["10118"]={     ----疆域月氏王委任状
            ["order"]=18,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={18},
        },
        ["10119"]={     ----疆域康居王委任状
            ["order"]=19,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={19},
        },
        ["10120"]={     ----疆域贵霜王委任状
            ["order"]=20,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={20},
        },
        ["10121"]={     ----疆域安息王委任状
            ["order"]=21,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={21},
        },
        ["10122"]={     ----疆域沙汗沙委任状
            ["order"]=22,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={22},
        },
        ["10123"]={     ----疆域土库曼汗委任状
            ["order"]=23,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={23},
        },
        ["10124"]={     ----疆域帕迪沙委任状
            ["order"]=24,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={24},
        },
        ["10125"]={     ----疆域大食哈里发委任状
            ["order"]=25,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_20",
            ["zhuheReward"]="1_1_20",
            ["needType"]=1,
            ["needValue1"]={25},
        },
        ["10126"]={     ----疆域真龙天子委任状
            ["order"]=1,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_50",
            ["zhuheReward"]="1_1_50",
            ["needType"]=2,
            ["needValue1"]={1,2,3,4},
        },
        ["10127"]={     ----疆域法王委任状
            ["order"]=2,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_50",
            ["zhuheReward"]="1_1_50",
            ["needType"]=2,
            ["needValue1"]={5,6,7,8,9},
        },
        ["10128"]={     ----疆域天可汗委任状
            ["order"]=3,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_50",
            ["zhuheReward"]="1_1_50",
            ["needType"]=2,
            ["needValue1"]={10,11,12,13,14,15},
        },
        ["10129"]={     ----疆域待定2委任状
            ["order"]=4,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_50",
            ["zhuheReward"]="1_1_50",
            ["needType"]=2,
            ["needValue1"]={16,17,18,19,20},
        },
        ["10130"]={     ----疆域万王之王委任状
            ["order"]=5,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_50",
            ["zhuheReward"]="1_1_50",
            ["needType"]=2,
            ["needValue1"]={21,22,23,24,25},
        },
        ["10131"]={     ----疆域大陆霸主委任状
            ["order"]=1,
            ["land"]=1,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_80",
            ["zhuheReward"]="1_1_100",
            ["needType"]=3,
            ["needValue1"]={1},
        },
        ["99999"]={     ----疆域全球霸主委任状
            ["order"]=1,
            ["land"]=0,
            ["shangxianReward"]="1_1_10",
            ["newKingReward"]="1_1_100",
            ["zhuheReward"]="1_1_150",
            ["needType"]=4,
        },
    },
    
    --历史纪年最大条目数
    maxRecord=100,
    
    --霸主之路膜拜奖励---每日1次---不分位置
    mobaiReward2="1_1_50",
    
    --疆域称号上线奖励的有效时间---秒     弹板弹出后，X秒不领取后，奖励失效
    shangxianTime=300,
    
    --祝贺奖励最大生效次数，只x个人能领到奖励----有人获得称号后可以发送到聊天里，别人可以进行祝贺领奖
    maxZhuheNum=10,
    
    --大陆列表
    --country:具体国家
    
    land={
        ["1"]={     ----亚洲
            ["country"]="country1",
        },
    },
    
    --
    --order:位置
    --show4:地图特性 1战争 2洪水 3联姻 4瘟疫
    --show:开启状态 【1开启】【空表示不可预览】【开关表示开关开启时可预览】  
    --show2:大地图奖励图标  1门客 2红颜  3战马  4文玩 5促织 6兵团 7奇观
    --show3:国家详情奖励--前端展示
    --skill:国家特性
    --activity:活动名称---开启指定活动后开启此国家的争夺
    
    country1={
        ["1"]={     ----梁益
            ["order"]=1,
            ["show4"]=2,
            ["show"]="1",
            ["show2"]=1,
            ["show3"]="8_2199_1|11_10101_1",
            ["skill"]={101,102,103},
            ["activity"]="teTianfuZhiqi",
        },
        ["2"]={     ----荆扬
            ["order"]=2,
            ["show4"]=3,
            ["show"]="1",
            ["show2"]=2,
            ["show3"]="10_2199_1|11_10102_1",
            ["skill"]={201,202,203},
            ["activity"]="teWangchaoLianyin",
        },
        ["3"]={     ----女真
            ["order"]=3,
            ["show4"]=1,
            ["show"]="legion_name3044",
            ["show2"]=6,
            ["show3"]="94_3044_1|11_10103_1",
            ["skill"]={301,302,303},
            ["activity"]="teJingzhu",
        },
        ["4"]={     ----雍凉
            ["order"]=4,
            ["show4"]=1,
            ["show"]="horseName_4051",
            ["show2"]=3,
            ["show3"]="52_4051_1|11_10104_1",
            ["skill"]={401,402,403},
            ["activity"]="teZhuibu",
        },
        ["5"]={     ----南诏
            ["order"]=5,
            ["show4"]=1,
            ["show"]="servant_name2203",
            ["show2"]=1,
            ["show3"]="8_2203_1|11_10105_1",
            ["skill"]={501,502,503},
            ["activity"]="teMenghuo",
        },
        ["6"]={     ----南越
            ["order"]=6,
            ["show4"]=1,
            ["show"]="cricketsName_4101",
            ["show2"]=1,
            ["show3"]="76_4101_1|11_10106_1",
            ["skill"]={601,602,603},
            ["activity"]="teNanjiang",
        },
        ["7"]={     ----暹罗
            ["order"]=7,
            ["show4"]=1,
            ["show"]="horseName_7101",
            ["show2"]=1,
            ["show3"]="52_7101_1|11_10107_1",
            ["skill"]={701,702,703},
            ["activity"]="teShengxiang",
        },
        ["8"]={     ----蒲甘
            ["order"]=8,
            ["show4"]=1,
            ["show"]="curios_name4901",
            ["show2"]=1,
            ["show3"]="66_4901_1|11_10108_1",
            ["skill"]={801,802,803},
            ["activity"]="teChuanjing",
        },
        ["9"]={     ----身毒
            ["order"]=9,
        },
        ["10"]={     ----鲜卑
            ["order"]=10,
        },
        ["11"]={     ----柔然
            ["order"]=11,
        },
        ["12"]={     ----突厥
            ["order"]=12,
        },
        ["13"]={     ----契丹
            ["order"]=13,
        },
        ["14"]={     ----回纥
            ["order"]=14,
        },
        ["15"]={     ----匈奴
            ["order"]=15,
        },
        ["16"]={     ----吐蕃
            ["order"]=16,
        },
        ["17"]={     ----楼兰
            ["order"]=17,
        },
        ["18"]={     ----月氏
            ["order"]=18,
        },
        ["19"]={     ----花剌子模
            ["order"]=19,
        },
        ["20"]={     ----贵霜
            ["order"]=20,
        },
        ["21"]={     ----安息
            ["order"]=21,
        },
        ["22"]={     ----塞尔柱
            ["order"]=22,
        },
        ["23"]={     ----土库曼
            ["order"]=23,
        },
        ["24"]={     ----波斯
            ["order"]=24,
        },
        ["25"]={     ----大食
            ["order"]=25,
        },
    },
    
    --每个国家每日产出贡品数量
    countryScore=300,
    
    --占领国家后，每个国家可领取贡品的次数
    countryScoreMax=7,
    
    --疆域国家特性类型
    --1--对spPar活动排名积分加成p1【百分比参数】，生效p2次
    --11--太学收益额外增加p1【百分比参数】，生效p2次----实际太学收益=太学基础收益*（天恩赐福倍率+活动倍率）*强化倍率+太学基础倍率*领地buff
    --12--寻访时额外获得亲密度p1点，生效p2次
    --13--议事院中，每次结算时额外获得书籍经验X（生效X次）按门客生效
    --14--训练场完成时额外获得x战马资历，最多生效y次
    --15--演武场获得演武经验额外增加p1【百分比参数】，生效p2次---举办者才加
    --16--促织pve中，每日快速挂机额外领取p1个p2道具，最懂领取x次
    --17--文玩pve中，每日快速挂机额外领取p1个p2道具，最懂领取x次
    
    --特性列表----相同id叠加生效次数，不同id叠加效果
    --skillType:技能类型
    --p1Type:p1参数类型---1百分比  空固定值
    --p1:参数1
    --p2:参数2
    --p3:参数3
    --spPar:特殊参数
    
    skillList={
        ["101"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teWangchaoLianyin"},
        },
        ["102"]={     ----跨服兵团资质分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossServerAbility","crossServerSoldierAbility"},
        },
        ["103"]={     ----太学收益额外增加500%
            ["skillType"]=11,     ----太学收益额外增加p1【百分比参数】，生效p2次----实际太学收益=太学基础收益*（天恩赐福倍率+活动倍率）*强化倍率+太学基础倍率*领地buff
            ["p1Type"]=1,
            ["p1"]=5,
            ["p2"]=100,
        },
        ["201"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teJingzhu"},
        },
        ["202"]={     ----跨服亲密分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossServerIntimacy"},
        },
        ["203"]={     ----寻访额外获得亲密1点
            ["skillType"]=12,     ----寻访时额外获得亲密度p1点，生效p2次
            ["p1"]=1,
            ["p2"]=300,
        },
        ["301"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teZhuibu"},
        },
        ["302"]={     ----跨服擂台分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"battleGround","crossServerAtkRace","armyToAttack"},
        },
        ["303"]={     ----议事院中，每次结算时额外获得书籍经验X（生效X次）
            ["skillType"]=13,     ----议事院中，每次结算时额外获得书籍经验X（生效X次）按门客生效
            ["p1"]=5,
            ["p2"]=300,
        },
        ["401"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teMenghuo"},
        },
        ["402"]={     ----跨服战马权势分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossServerHorsePower"},
        },
        ["403"]={     ----训练场完成时额外获得x资质经验
            ["skillType"]=14,     ----训练场完成时额外获得x战马资历，最多生效y次
            ["p1"]=20,
            ["p2"]=300,
        },
        ["501"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teNanjiang"},
        },
        ["502"]={     ----跨服兵团资质分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossServerAbility","crossServerSoldierAbility"},
        },
        ["503"]={     ----演武场演武经验额外获得x
            ["skillType"]=15,     ----演武场获得演武经验额外增加p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=1,
            ["p2"]=10,
        },
        ["601"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teShengxiang"},
        },
        ["602"]={     ----跨服促织权势分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossCricketsAttribute"},
        },
        ["603"]={     ----促织pve中，每日快速挂机额外领取p1个p2道具，最懂领取x次
            ["skillType"]=16,     ----促织pve中，每日快速挂机额外领取p1个p3道具，最懂领取p2次
            ["p1"]=1,
            ["p2"]=30,
            ["p3"]=1633,
        },
        ["701"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"teChuanjing"},
        },
        ["702"]={     ----跨服战马资质分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossServerHorsePower"},
        },
        ["703"]={     ----训练场完成时额外获得x战马资历，最多生效y次
            ["skillType"]=14,     ----训练场完成时额外获得x战马资历，最多生效y次
            ["p1"]=20,
            ["p2"]=300,
        },
        ["801"]={     ----下一个领地冲榜分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"te"},
        },
        ["802"]={     ----跨服文玩权势分数+10%
            ["skillType"]=1,     ----对spPar活动排名积分加成p1【百分比参数】，生效p2次
            ["p1Type"]=1,
            ["p1"]=0.1,
            ["p2"]=1,
            ["spPar"]={"crossCuriosPower","crossCuriosGroupPower"},
        },
        ["803"]={     ----文玩pve中，每日快速挂机额外领取p1个p2道具，最懂领取x次
            ["skillType"]=17,     ----文玩pve中，每日快速挂机额外领取p1个p3道具，最多领取p2次
            ["p1"]=20,
            ["p2"]=30,
            ["p3"]=1683,
        },
    },
    
    --疆域商店
    --getReward:商品
    --order:排序   数字越小越靠前
    --needSwitch:需要对应开关打开才能看见
    --limitType:限购类型  1日限购 2周限购 3月限购
    --limitNum:限购数量
    --cost:消耗贡品--疆域国家每日产出---消耗递增，超过最大值取最大值
    
    countryShop={
        ["1"]={
            ["getReward"]="6_6426_1",
            ["order"]=1,
            ["needSwitch"]="servant_name2199",
            ["limitType"]=2,
            ["limitNum"]=25,
            ["cost"]={300},
        },
        ["2"]={
            ["getReward"]="6_6537_1",
            ["order"]=2,
            ["needSwitch"]="wifeName_2199",
            ["limitType"]=2,
            ["limitNum"]=25,
            ["cost"]={300},
        },
        ["3"]={
            ["getReward"]="6_64088_1",
            ["order"]=3,
            ["needSwitch"]="legion_name3044",
            ["limitType"]=2,
            ["limitNum"]=25,
            ["cost"]={300},
        },
        ["4"]={
            ["getReward"]="6_25051_1",
            ["order"]=3,
            ["needSwitch"]="horseName_4051",
            ["limitType"]=2,
            ["limitNum"]=25,
            ["cost"]={300},
        },
        ["5"]={
            ["getReward"]="6_6427_1",
            ["order"]=3,
            ["needSwitch"]="servant_name2203",
            ["limitType"]=2,
            ["limitNum"]=25,
            ["cost"]={300},
        },
    },
    
    --疆域成就
    --land:所需大陆
    --taskType:任务类型   【1参与过x次疆域争夺的活动--个人判断--对应活动有排名分即可】【2获得疆域称号x--个人判断】【3占领过此大陆X个领地--领地判断--重复国家不算，全领国领奖】
    --value:参数1
    --need:条件
    --getReward:奖励
    
    achievement={
        ["1"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=1,
            ["getReward"]="451_7_100",
        },
        ["2"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=2,
            ["getReward"]="451_7_200",
        },
        ["3"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=3,
            ["getReward"]="451_7_300",
        },
        ["4"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=5,
            ["getReward"]="451_7_400",
        },
        ["5"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=7,
            ["getReward"]="451_7_500",
        },
        ["6"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=10,
            ["getReward"]="451_7_600",
        },
        ["7"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=15,
            ["getReward"]="451_7_700",
        },
        ["8"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=20,
            ["getReward"]="451_7_800",
        },
        ["9"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=25,
            ["getReward"]="451_7_900",
        },
        ["10"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=30,
            ["getReward"]="451_7_1000",
        },
        ["11"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=40,
            ["getReward"]="451_7_1000",
        },
        ["12"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=50,
            ["getReward"]="451_7_1000",
        },
        ["13"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=70,
            ["getReward"]="451_7_1000",
        },
        ["14"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=100,
            ["getReward"]="451_7_1000",
        },
        ["15"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=150,
            ["getReward"]="451_7_1000",
        },
        ["16"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=200,
            ["getReward"]="451_7_1000",
        },
        ["17"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=250,
            ["getReward"]="451_7_1000",
        },
        ["18"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=300,
            ["getReward"]="451_7_1000",
        },
        ["19"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=400,
            ["getReward"]="451_7_1000",
        },
        ["20"]={     ----参与疆域争夺X次
            ["land"]=1,
            ["taskType"]=1,
            ["value"]=500,
            ["getReward"]="451_7_1000",
        },
        ["21"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10101,
            ["getReward"]="451_7_2000",
        },
        ["22"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10102,
            ["getReward"]="451_7_2000",
        },
        ["23"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10103,
            ["getReward"]="451_7_2000",
        },
        ["24"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10104,
            ["getReward"]="451_7_2000",
        },
        ["25"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10105,
            ["getReward"]="451_7_2000",
        },
        ["26"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10106,
            ["getReward"]="451_7_2000",
        },
        ["27"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10107,
            ["getReward"]="451_7_2000",
        },
        ["28"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10108,
            ["getReward"]="451_7_2000",
        },
        ["29"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10109,
            ["getReward"]="451_7_2000",
        },
        ["30"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10110,
            ["getReward"]="451_7_2000",
        },
        ["31"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10111,
            ["getReward"]="451_7_2000",
        },
        ["32"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10112,
            ["getReward"]="451_7_2000",
        },
        ["33"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10113,
            ["getReward"]="451_7_2000",
        },
        ["34"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10114,
            ["getReward"]="451_7_2000",
        },
        ["35"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10115,
            ["getReward"]="451_7_2000",
        },
        ["36"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10116,
            ["getReward"]="451_7_2000",
        },
        ["37"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10117,
            ["getReward"]="451_7_2000",
        },
        ["38"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10118,
            ["getReward"]="451_7_2000",
        },
        ["39"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10119,
            ["getReward"]="451_7_2000",
        },
        ["40"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10120,
            ["getReward"]="451_7_2000",
        },
        ["41"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10121,
            ["getReward"]="451_7_2000",
        },
        ["42"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10122,
            ["getReward"]="451_7_2000",
        },
        ["43"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10123,
            ["getReward"]="451_7_2000",
        },
        ["44"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10124,
            ["getReward"]="451_7_2000",
        },
        ["45"]={     ----获得疆域称号
            ["land"]=1,
            ["taskType"]=2,
            ["value"]=1,
            ["need"]=10125,
            ["getReward"]="451_7_2000",
        },
        ["46"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=1,
            ["getReward"]="451_7_500",
        },
        ["47"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=2,
            ["getReward"]="451_7_500",
        },
        ["48"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=3,
            ["getReward"]="451_7_500",
        },
        ["49"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=4,
            ["getReward"]="451_7_500",
        },
        ["50"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=5,
            ["getReward"]="451_7_500",
        },
        ["51"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=6,
            ["getReward"]="451_7_500",
        },
        ["52"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=7,
            ["getReward"]="451_7_500",
        },
        ["53"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=8,
            ["getReward"]="451_7_500",
        },
        ["54"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=9,
            ["getReward"]="451_7_500",
        },
        ["55"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=10,
            ["getReward"]="451_7_500",
        },
        ["56"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=11,
            ["getReward"]="451_7_500",
        },
        ["57"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=12,
            ["getReward"]="451_7_500",
        },
        ["58"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=13,
            ["getReward"]="451_7_500",
        },
        ["59"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=14,
            ["getReward"]="451_7_500",
        },
        ["60"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=15,
            ["getReward"]="451_7_500",
        },
        ["61"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=16,
            ["getReward"]="451_7_500",
        },
        ["62"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=17,
            ["getReward"]="451_7_500",
        },
        ["63"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=18,
            ["getReward"]="451_7_500",
        },
        ["64"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=19,
            ["getReward"]="451_7_500",
        },
        ["65"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=20,
            ["getReward"]="451_7_500",
        },
        ["66"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=21,
            ["getReward"]="451_7_500",
        },
        ["67"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=22,
            ["getReward"]="451_7_500",
        },
        ["68"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=23,
            ["getReward"]="451_7_500",
        },
        ["69"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=24,
            ["getReward"]="451_7_500",
        },
        ["70"]={     ----领国占领此大陆X个领土
            ["land"]=1,
            ["taskType"]=3,
            ["value"]=25,
            ["getReward"]="451_7_500",
        },
    },
    
}
return terriotyCfg
