r'''
----问答----
0. 请问下面代码有没有毛病，为什么？
input = "I love FishC.com"
print(input)
I love FishC.com
答：有毛病, 因为input是一个内置函数, 不适合作变量名使用, 如果作为了变量名使用, 那么input()就无法使用了

1. 请问下面代码为什么会出错，应该如何解决？
print("C:\Users\goodb\Desktop")
yntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated 
\UXXXXXXXX escape
答: 因为 反斜杠加一个字母或者符号是代表着转义的意思, 而代码读到\U的时候python发现\U不是可转义的符号,所以报错
可以再加上一个\, 使得\\变为\, print("C:\\Users\\goodb\\Desktop")

2. 如果要为一个函数写说明文档，那么你觉得应该使用哪种字符串比较合适？
答: 用 三引号字符串''''''方式比较合适

3. 请问是 '123' 大还是 256 大？
答: 无法比较, 因为不是同一类型的数据 会报错

4. 请写出下面几个表达式的结果。
A. '123' + 456
B. '123' + '256'
C. '123' * 3
D. '123' - '12'
答: A 会报错, 因为不是同一类型的数据, 无法相加; B '123456' 都是字符串, + 代表拼接相加; C '123123123' 字符串乘以几代表几个字符串相加; 
D 会报错 字符串之间无法进行减法操作 


----动动手----
0. 请将下面的文本拷贝并赋值给变量名(fishc)，使其可以如下图的效果打印输出。
      ___                     ___          ___          ___     
     /\  \         ___       /\  \        /\__\        /\  \   
    /::\  \       /\  \     /::\  \      /:/  /       /::\  \   
   /:/\:\  \      \:\  \   /:/\ \  \    /:/__/       /:/\:\  \  
  /::\~\:\  \     /::\__\ _\:\~\ \  \  /::\  \ ___  /:/  \:\  \
/:/\:\ \:\__\ __/:/\/__//\ \:\ \ \__\/:/\:\  /\__\/:/__/ \:\__\
\/__\:\ \/__//\/:/  /   \:\ \:\ \/__/\/__\:\/:/  /\:\  \  \/__/
      \:\__\  \::/__/     \:\ \:\__\       \::/  /  \:\  \      
       \/__/   \:\__\      \:\/:/  /       /:/  /    \:\  \     
                \/__/       \::/  /       /:/  /      \:\__\   
                             \/__/        \/__/        \/__/

'''
fishc_1 ='            ___                     ___          ___          ___     \n\
           /\  \         ___       /\  \        /\__\        /\  \ \n \
         /::\  \       /\  \     /::\  \      /:/  /       /::\  \ \n \
        /:/\:\  \      \:\  \   /:/\ \  \    /:/__/       /:/\:\  \  \n\
        /::\~\:\  \     /::\__\ _\:\~\ \  \  /::\ \_ _    /:/  \:\  \ \n\
       /:/\:\ \:\__\ __/:/\/__//\ \:\ \ \__\/:/\:\/\_/   /:/__/ \:\__\ \n\
       \/__\:\ \/__//\/:/ /  \:\ \:\ \/__/\/__\:\/: /   /\:\ \ \/__/ \n\
              \:\__\  \::/__/ \:\ \:\__\      /::/ /    \: \  \      \n\
               \/__/   \:\__\      \:\/:/  / /:/  /      \: \  \     \n\
                        \/__/       \::/  / /:/  /        \: \__\   \n\
                                     \/__/  \/__/          \/__/'
    


fishc = r"""
      ___                     ___          ___          ___     
     /\  \         ___       /\  \        /\__\        /  \  \   
    /::\  \       /\  \     /::\  \      /:/  /       /::  \  \   
   /:/\:\  \      \:\  \   /:/\ \  \    /:/__/       /:  /\:\  \  
  /::\~\:\  \     /::\__\ _\:\~\ \  \  /::\  \ ___  /:  /  \:\  \
/:/\:\ \:\__\ __/:/\/__//\ \:\ \ \__\/:/\:\  /\__\/:/__/    \:\__\
\/__\:\ \/__//\/:/  /   \:\ \:\ \/__/\/__\:\/:/  /\:\  \     \/__/
      \:\__\  \::/__/     \:\ \:\__\       \::/  / \:\  \      
       \/__/   \:\__\      \:\/:/  /       /:/  /   \:\  \     
                \/__/       \::/  /       /:/  /     \:\__\   
                             \/__/        \/__/       \/__/
"""


print(fishc)

x = 1
while x <= 9:
    y = 1
    while y <= x:
        print(y, 'X', x, '=', x * y, end = '  ')
        y += 1
    x += 1
    print('')

print('\n')


a = 9
for i in range(a):
    for k in range(i + 1):
        print(k + 1, 'x', i + 1, '=', (k + 1) * (i + 1), end = '  ')
    print('')
        
print('\n')
s = 1 
for i in range(9):
    for k in range(s):
        print(k + 1, 'x', i + 1, '=', (k + 1) * (i + 1), end = '  ')
    s += 1
    print(' ')

print('\n')

print('\n')
print('\n')
for i in range(1, 10):
    for k in range(1, i + 1):
        print(k, 'x', i, '=', k * i, end = ' ' )
    print('')