r'''
----问答题----
0. 请根据以下代码画出对应的流程图
n = int(input("请输入一个数："))
print(n)
答: 创建变量为 n 用来接收用户输入
            ↓
            ↓
    转换 n 的数据类型 为 int
            ↓
            ↓
       赋值给变量 n
            ↓
            ↓
    打印 n 的 value

1. 请根据以下代码画出对应的流程图
j = 0
while j < n-i:
    print(" ", end="")
    j = j + 1

答:   创建变量 j 为 0
             ↓
             ↓
             ↓
             ↓                  
->->->判断 j 是否小于 n - i  ->->->->->->
↑            ↓                         ↓
↑            ↓                         ↓  
↑            ↓ 是                      ↓  否
↑            ↓                         ↓
↑    打印空格, 末尾结束不换行           pass
↑            ↓
↑            ↓
↑            ↓
↑            ↓
<-<-<-<- j 每次自加 1


2. 请根据以下代码画出对应的流程图 '''

n = int(input('请输入三角形的层数'))
i = 1
while i <= n:
    j = 0
    while j < n - i:
        print(' ', end = '')
        j = j + 1
    j = 0
    while j < 2 * i  - 1:
        print('* ', end = ' ')
        j = j + 1

    print('')
    i = i + 1

r'''
答:                  创建变量 n, 用来接收用户输入的数字
                                ↓
                                ↓
                                ↓
                                ↓
                          创建变量 i 为1
                                ↓
                                ↓
                                ↓
                                ↓
↑->->->->->->->->  判断 i 是否小于等于 n  ->->->->->->->->->->
↑                                ↓                          ↓
↑                                ↓                          ↓  
↑                                ↓ 是                       ↓  否
↑                                ↓                          ↓
↑                                ↓                          ↓
↑                        创建变量 j 为 0                   pass
↑                                ↓
↑                                ↓
↑                                ↓
↑                                ↓
↑            ↑->->->-> 判断 j 是否小于 n - i  ->->->->->->->->
↑            ↑                   ↓                          ↓
↑            ↑                   ↓                          ↓
↑            ↑                   ↓  是                      ↓  否
↑            ↑                   ↓                          ↓
↑            ↑                   ↓                          ↓
↑            ↑        打印空格, 末尾结束不换行           创建变量 j 为 0 
↑            ↑                   ↓                          ↓
↑            ↑                   ↓                          ↓
↑            ↑                    ↓                         ↓
↑            ↑                   ↓                          ↓
↑            <-<-<-<-<-<-<-<- j 自加 1                 判断 j 是否小于 2 * i - 1 ->->->->->->->
↑                                                           ↓                               ↓
↑                                                           ↓                               ↓ 
↑                                                           ↓  是                           ↓  否
↑                                                           ↓                               ↓
↑                                                           ↓                               ↓
↑                                                    打印 * , 末尾结束不换行                打印空格
↑                                                           ↓                               ↓
↑                                                           ↓                               ↓
↑                                                           ↓                               ↓   
↑                                                           ↓                               ↓  
↑                                                        j 自加 1                           ↓ 
↑                                                                                           ↓
↑                                                                                           ↓
<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-<-    i 自加1



4. 从键盘输入一个整数，判断该数字 “能否被 2 和 3 同时整除 / 能否被 2 整除 / 能否被 3 整除 / 不能被 2 和 3 整除” 4 种情况，并分别打印结果。
答:           创建变量 num 为用户输入的数字
                        ↓
                        ↓
                        ↓
                        ↓
        判断 num 除以2余数是否等于0 且 num 除以3余数是否等于0 ->->->->->->->->->->
                        ↓                                                     ↓
                        ↓                                                     ↓
                        ↓   是                                                ↓  否
                        ↓                                                     ↓
                        ↓                                                     ↓
          打印该数字可以同时被2和3整除                                         pass


          判断 num 除以2余数是否等于0 ->->->->->->->->->->->->->->->->->->->->->
                        ↓                                                     ↓
                        ↓                                                     ↓
                        ↓   是                                                ↓  否
                        ↓                                                     ↓
                        ↓                                                     ↓
              打印该数字可以2被整除                                            pass


           判断 num 除以3余数是否等于0 ->->->->->->->->->->->->->->->->->->->->->
                        ↓                                                     ↓
                        ↓                                                     ↓
                        ↓   是                                                ↓  否
                        ↓                                                     ↓
                        ↓                                                     ↓
              打印该数字可以3被整除                                            pass

        判断 num 除以2余数不等于0 且 num 除以3余数不等于0->->->->->->->->->->>->->
                        ↓                                                     ↓
                        ↓                                                     ↓
                        ↓   是                                                ↓  否
                        ↓                                                     ↓
                        ↓                                                     ↓
          打印该数字该数字不能被 2 和 3 整除                                   pass





'''
num = int(input('请输入数字'))
if num % 2 == 0 and num % 3 == 0:
    print('该数字可以同时被2和3整除')
if num % 2 == 0:
    print('该数字可以2被整除')
if num % 3 == 0:
    print('该数字可以3被整除')
if num % 2 != 0 and num % 3 != 0:
    print('该数字不能被 2 和 3 整除')