r'''
----问答题----
0. 请问下面代码打印的结果是什么？
for i in range(10):
    print(i, end=' ')
    i = 5
答: 会打印0 1 2 3 4 5 6 7 8 9 


1. 请问下面代码打印的结果是什么？
a, b, c = range(3, 10, 3)
print(a + b + c)
答: 打印 18

2. 请问下面代码打印的结果是什么？
len(range(0, 10, 2))
答: 打印 5

3. 请问下面代码打印的结果是什么？
len("FishC") + len(110)
答: 代码会报错

4. 请问下面代码执行后，result 变量的值是多少？
result = 0
for each in range(-10, -100, -20):
    result += each
答: -10 + -30 + -50 + -70 + -90 = -250

5. 请问下图中，红色涂抹的位置应该填写什么代码，程序才能如期执行？
for num in range(2, 10):
    if num % 2 == 0:
        print(num, '是偶数。')
    else:
        print(num,'是奇数。')




==================================================我是一条分割线=====================================


----动动手：----

0. 编写一个程序，求解 100~999 之间的所有水仙花数。

'''
max = 999
min = 100
for i in range(min, max):
    if (i // 100) ** 3 + (i // 10 % 10) ** 3 + (i % 100 % 10) ** 3 == i:
        print(i, '是水仙花数字')


r'''
1. 判断一个整数是否为回文数。

'''
n = int(input('请输入一个数字, 用来判断是否为回文数'))
x = 0
if n < 0 or (n != 0 and n % 10 == 0):
    print(n, '不是回文数')
else:
    while n > x:
        x = x * 10 + n % 10
        n  = n // 10
if x == n or n == x // 10:
    print( '是回文数')
else:
    print('不是回文数')
